# จงเขียนโปรแกรมรับเลขจำนวนเต็ม 0 - 9 ไปเรื่อยๆ 

# โปรแกรมจะหยุดรับก็ต่อเมื่อผู้ใช้ป้อนเลขผิด เช่น ป้อนเลข 10 เลข -1 หรือเลขอื่นๆ ที่อยู่นอกขอบเขต 0 - 9

# เมื่อโปรแกรมหยุดรับค่า ให้แสดงผลว่าเลข 0 - 9 มีการป้อนเลขเข้าไปกี่ครั้ง ดังตัวอย่าง

# หมายเหตุ ในคำสั่ง print ในรูปแบบ print("0=",ตัวแปร)

count = [0,0,0,0,0,0,0,0,0,0]

while(True) : 
    number = int(input("Please enter number between 0-9 : "))
    if(number < 0 or number > 9 ) : break;

    count[number] += 1

for i in range(len(count)) :
    print(i , " = ", count[i])

    
