# ครูโจ๊กไปซื้อนาฬิกาสำหรับวิ่งยี่ห้อกาม๊องมา 1 เรือน เพื่อนำมาใช้วิ่งและจับเวลา
# แต่พบว่านาฬิกากาม๊องเรือนนี้แสดงผลเป็นวินาทีเท่านั้น ทำให้ครูโจ๊กปวดหัวมาก
# ที่จะต้องมานั่งคำนวณเพื่อที่จะให้ทราบว่าวิ่งไปแล้วกี่วัน กี่ชั่วโมง กี่นาที และกี่วินาที


# ประจวบเหมาะพอดีที่ใกล้ๆ บ้านมีการอบรม Core Training ซึ่งมีคุณครูที่เขียนโปรแกรม
# เก่งมากๆ ครูโจ๊กก็เลยไปรบกวนให้คุณครูช่วยเขียนโปรแกรมใส่นาฬิกาให้หน่อย


# ช่วยเขียนโปรแกรมแปลงเลขวินาทีให้ทราบว่านาฬิกาจับเวลานั้น 
# ได้จับเวลาไปแล้วกี่วัน กี่ชั่วโมง กี่นาที และกี่วินาทีด้วยครับ

input = int(input("Please enter time in seconds(s) : "))

day, hour, minute, second, = 0, 0, 0, 0

# 1 day = 86400s
if(input >= 86400) :
    day = input//86400
    input = input % 86400
    
# 1 hour = 3600s
if(input >= 3600) :
    hour = input//3600
    input = input % 3600
    print(input)

# 1 minute = 60s
if(input >= 60) :
    minute = input//60
    input = input % 60 

print(day, " day(s) ", hour, "hour(s) ", minute, " minute(s) ", input, " second(s)" )       