# ปีนี้รัฐบาลของเทเลทับบี้ได้ประกาศอัตราการเก็บภาษีเงินได้ใหม่ ดังนี้
# ถ้ารายได้น้อยกว่า 100000 เทเล จะไม่เสียภาษี
# แต่ถ้ารายได้ระหว่าง 100000 - 500000 เทเล จะเสียภาษี 5%
# แต่ถ้ารายได้ระหว่าง 500001 - 1000000 เลเล จะเสียภาษี 10%
# และถ้ามากกว่านั้น จะเสียภาษี 20% 


# ถ้าสมาชิกในบ้านของทิงกี้วิงกี้มีสมาชิกที่มีรายได้ทั้งหมด 4 คน (เป็นจำนวนเต็ม) ได้แก่ 
# ทิงกี้วิงกี้ ดิสซี่ ลาล่า และโพล บ้านนี้จะต้องเสียภาษีรวมกันกี่เทเล


# ให้เขียนโปรแกรมรับค่ารายได้ของสมาชิกในบ้านทั้ง 4 คน แล้วคิดภาษีรวมที่จะต้องจ่าย
# โดยแสดงผลรวมภาษีของทุกคนเป็นทศนิยม 2 ตำแหน่ง

import decimal

start, stop = 1, 4
sum, salary = 0, 0.00

while(start <= 4) :
    salary = int(input("Give me youe salary : "))
    if (salary > 1000000) : 
        sum += (20 / 100) * salary
    elif (salary >= 500001 and salary <= 1000000) :
        sum += (10 / 100) * salary
    elif (salary >= 100000 and salary <= 500000) :
        sum += (5 / 100) * salary

    start += 1

print("all taxes : ", "{:.2f}".format(sum))        