# ช่วยเหลือเกษตรกร
# รัฐบาลประกาศที่จะช่วยเหลือเกษตรกรที่ประสบภัยน้ำท่วม โดยมอบเงินให้ตามจำนวนที่ดิน เป็นเงิน ไร่ละ 1,000 บาท แต่ยอดเงินช่วยเหลือรวมต้องไม่เกิน 10,000 บาท
# (เศษจากไร่ให้คิดเป็น 1 ไร่ เช่น 1 ไร่ กับ 1 ตารางเมตร ให้คิดเป็น 2 ไร่)

# นายณเดช หรือเรียกสั้นๆ ว่า "โจ๊ก" มีพื้นที่การเกษตรของตนเองที่ประสบภัยน้ำท่วม แต่ก็ไม่แน่ใจว่าที่ดินของตนเองมีกี่ไร่
# รู้เพียงว่ามีขนาดกว้าง x เมตร และยาว y เมตร

# จงเขียนโปรแกรมคำนวณพื้นที่ไร่ (ที่ปัดเศษขึ้นแล้ว) และจำนวนเงินช่วยเหลือที่จะได้รับ

# กำหนดให้ 1 ไร่ = 1600 ตารางเมตร

import math

width = float(input("กว้าง(m) : "))
length = float(input("ยาว(m) : "))

# สูตรหาไร่ พื้นที่ * 0.000625
r = math.ceil((width * length) * 0.000625)
print(r, " ไร่")
sum = r * 1000

if(sum > 10000) : sum = 10000

print("bonus : ", sum)


