# ครูโจ๊กได้รับมอบหมายจากผู้อำนวยการโรงเรียนให้ดำเนินโครงการโรงเรียนส่งเสริมสุขภาพโดยให้นับจำนวนนักเรียนที่น้ำหนักต่ำกว่าเกณฑ์ (bmi < 18.5) แต่ก็ไม่รู้ว่านักเรียนทั้งหมดมีกี่คน

# ให้เขียนโปรแกรมรับน้ำหนัก(kg) และส่วนสูง(cm) ของนักเรียนไปเรื่อยๆ (รับค่าเป็นจำนวนเต็มบวก) โดยโปรแกรมจะหยุดรับค่าเมื่อน้ำหนักหรือส่วนสูงที่ป้อนเข้าไปน้อยกว่าหรือเท่ากับศูนย์ จากนั้นให้แสดงผลจำนวนนักเรียนที่มีน้ำหนักต่ำกว่าเกณฑ์

sum = 0

while(True) :
    weight = int(input("Please enter your weight(kg) : "))
    height = int(input("Please enter your height(cm) : ")) * 0.01
    
    if(weight <= 0 or height <= 0) : break

    bmi = weight / (height * height)

    print(bmi)

    if(bmi < 18.5) : 
        sum += 1

print("น้ำหนักต่ำกว่าเกณฑ์ : ", sum, " คน")