# รถไฟฟ้า...มาหานะเธอ2
# สถานีรถไฟฟ้าประเทศหนึ่ง มีตู้สำหรับให้ผู้ใช้รถไฟฟ้าซื้อบัตรได้อัตโนมัติ โดยเลือกสถานีปลายทางที่ต้องการลง

# สถานีปลายทางจะมี 3 สถานี คือ
# สถานีที่ 1 ค่าโดยสาร 27 บาท, สถานทีที่ 2 ค่าโดยสารที่ต้องจ่าย 35 บาท และสถานีที่ 3 ค่าโดยสาร 42 บาท

# โดยผู้ซื้อบัตรจะต้องจ่ายเงินให้มากกว่าสถานีปลายทางที่ต้องการลง(บังคับ)
# จากนั้นตู้จำหน่ายบัตรจะจ่ายบัตรและเงินทอนให้ผู้ใช้รถไฟฟ้าเป็นเหรียญทั้งหมด โดยเหรียญที่ทอนจะมีเหรียญ 1, 2, 5 และ 10 บาทเท่านั้น และจะทอนเหรียญที่มีมูลค่าสูงสุดก่อน

# จงเขียนโปรแกรมสำหรับตู้จ่ายบัตรโดยสาร โดยให้ผู้ใช้เลือกสถานีปลายทาง(n) และจำนวนเงินที่ใส่เข้าระบบ(m)
# จากนั้นให้โปรแกรมบอกจำนวนเหรียญต่างๆ ที่ต้องทอนให้ผู้ซื้อบัตรโดยสาร 

d = 0;

n = int(input("Please enter destination station : "))
m = int(input("PLease enter money : "))

if(n == 1) :
    d = m - 27
elif(n == 2) :
    d = m - 35
elif(n == 3) :
    d = m - 42

if(d >= 10) :
    print("10 bath : ", d//10)
    d = d%10     

if(d >= 5) :
    print("5 bath : ", d//5)
    d = d%5  

if(d >= 2) :
    print("2 bath : ", d//2)
    d = d%2 

if(d >= 1) :
    print("1 bath : ", d//1)
    d = d%1     