# ตู้ ATM ของฉัน 
# ธนาคารแห่งหนึ่งให้กำหนดกฎเกณฑ์ในการกดเงินจากตู้ ATM ดังนี้
# - กดเงินได้ครั้งละไม่เกิน 20,000 บาท และกดได้ 2 ครั้ง (หากครั้งที่ 2 ไม่กดให้ใส่ 0)
# - ตู้ ATM จะจ่ายเงินในรูปแบบธนบัตรใบละ 1,000 500 และ 100 บาท และจะจ่ายธนบัตรที่มีค่ามากที่สุดก่อน


# เช่น ครูโจ๊กต้องการไปกดเงิน 2 ครั้ง ครั้งแรกกดเงิน 15,900 บาท และครั้งที่ 2 กดเงิน 5,700 บาท
# ครูโจ๊กจะได้ธนบัตรใบละ 1,000 บาทจำนวน 20 ใบ ธนบัตรใบละ 500 บาท จำนวน 2 ใบ และธนบัตรใบละ 100 บาท จำนวน 6 ใบ
# แต่ถ้าผู้กดเงินกรอกจำนวนเงินผิดพลาด โปรแกรมจะแสดงข้อความแจ้งเตือน (Input Error)
# จงเขียนโปรแกรมตู้ ATM นี้

try :
    m1 = int(input("Please enter money 1 : "))
    m2 = int(input("Please enter money 2 : "))
except ValueError :
    print('Input Error')

if(m1 > 20000 or m2 > 20000) :
    print('Input Error (Maximum number is 20000)')
    exit()

sum = m1 + m2

if(sum >= 1000) :
    print("1000 bath : ", sum//1000)
    sum = sum%1000
else : print("1000 bath : 0")

if(sum >= 500) :
    print("500 bath : ", sum//500)
    sum = sum%500
else : print("500 bath : 0")

if(sum >= 100) :
    print("100 bath : ", sum//100)
    sum = sum%500
else : print("100 bath : 0")

if(sum > 0 and sum < 100) : print("remain : ", sum)



